package Seminar1;// Реализуйте метод, принимающий в качестве аргумента целочисленный массив и некоторое значение.
// Метод ищет в массиве заданное значение и возвращает его индекс. При этом, например:

//        1. если длина массива меньше некоторого заданного минимума, метод возвращает -1, в качестве кода ошибки.
//        2. если искомый элемент не найден, метод вернет -2 в качестве кода ошибки.
//        3. если вместо массива пришел null, метод вернет -3
//        4. придумайте свои варианты исключительных ситуаций и верните соответствующие коды ошибок.
//
//        Напишите метод, в котором реализуйте взаимодействие с пользователем.
//        То есть, этот метод запросит искомое число у пользователя, вызовет первый,
//        обработает возвращенное значение и покажет читаемый результат пользователю.
//        Например, если вернулся -2, пользователю выведется сообщение: “Искомый элемент не найден”.
public class Task2 {
    private final static int MIN_LENGTH = 5; // константное значение
    public static void main(String[] args) {
        System.out.println(findIndexOf(5, new int[]{1, 3, 6, 7, 8, 9}));
    }
    private static int findIndexOf(int value, int[] array){
        if(array == null){ // проверка на null
            return -3;
        }
        if(array.length < MIN_LENGTH){ // если длинна меньше заданного мин
            return -1;
        }
        for(int i = 0; i < array.length; i++){ // если искомый элемент не найден
            if(value == array[i]){
                return 1;
            }
        }
        return -2;
    }
}


